Repository: tamrattamrat0506-code/tamrat_render_poultry
Catalog: conversation/locale/*/LC_MESSAGES/django.po
Languages: am

source: Conversation about
am: ውይይት ስለ

source: Send
am: ላክ

source: Your Conversations
am: የእርስዎ ውይይቶች

source: No Image
am: ምስል የለም

source: No messages yet
am: መልእክቶች አልተላኩም

source: No conversations yet
am: ምንም ውይይቶች አልተጀመሩም

source: Browse Items
am: እቃዎችን ያስሱ

source: New Message
am: አዲስ መልእክት

source: Contact the seller about:
am: ለእቃው በተመለከተ ከሸያጩ ያግኙ:

source: Your Message
am: መልእክትዎ

source: Send Message
am: መልእክት ላክ

source: Cancel
am: ሰርዝ
