Repository: tamrattamrat0506-code/tamrat_render_poultry
Catalog: */locale/om/LC_MESSAGES/django.po
Languages: om

source: About Us
om: Waa'ee Keenya

source: We are a company dedicated to providing the best services to our customers.
om: Kompaniin tajaajila gaarii maamiltoota keenyaaf kennuuf kutannoo qabdu.

source: Our mission is to connect buyers and sellers in a seamless online marketplace.
om: Kaayyoon keenya gurgurtaa fi bittoota wal qunnamsiisuun gabaa interneetii irratti walitti fiduu dha.

source: We strive to offer a wide range of products at competitive prices, backed by excellent customer service.
om: Meeshaalee bal'oo gatii dorgomaa fi tajaajila maamilaa gaarii waliin dhiheessuuf hojjenna.

source: Admin Links
om: Liinkii Admin

source: View Messages
om: Ergaa Ilaali

source: View Contact Us Messages
om: Ergaa Nu Quunnami Ilaali

source: You are not logged in.
om: Hin seene.

source: Login
om: Seeni

source: Ethiopian marketplace - Buy and sell products in Ethiopia
om: Gabaa Itoophiyaa - Meeshaalee Itoophiyaa keessatti bitadhaa fi gurguradhaa

source: Sheger.xyz | Ethiopian Market place
om: Sheger.xyz | Gabaa Itoophiyaa

source: Please select your language
om: Afaan kee filadhu

source: Skip
om: Darbi

source: All Items
om: Meeshaalee Hundaa

source: Contact Us
om: Nu Quunnami

source: city
om: magaalaa

source: Search products
om: Meeshaalee barbaadi

source: All Categories
om: Kutaa Hundaa

source: Cars
om: Mootoraalee

source: Houses
om: Manaalee

source: Electronics
om: Elekktirooniksii

source: Clothing
om: Uffata

source: Kids Toys
om: Taphataa ijoollee

source: Register
om: Galmaa'i

source: Cars for Sale
om: Mootoraalee Gurgurtaa

source: Houses for Sale
om: Manaalee Gurgurtaa

source: Electronics
om: Elekktirooniksii

source: Clothing
om: Uffata

source: Poultry Items
om: Meeshaalee Foollee

source: Message
om: Ergaa

source: About us
om: Waa'ee keenya

source: Admin Links
om: Liinkii Admin

source: User list
om: Tarree fayyadamtootaa

source: Cart
om: Kaartii

source: Home
om: Mana

source: Cars
om: Mootoraalee

source: Houses
om: Manaalee

source: Poultry
om: Foollee

source: Market
om: Gabaa

source: Hub
om: Bu'uura

source: Sheger.xyz is your one-stop online marketplace for cars, houses, electronics, clothing and kids toys. We connect buyers and sellers across the globe.
om: Sheger.xyz gabaa interneetii tokko qofa mootoraalee, manaalee, elekktirooniksii, uffata fi taphataa ijoollee. Bittoota fi gurgurtoota addunyaa walitti fidna.

source: Quick Links
om: Liinkii Ariifachiisaa

source: Home
om: Mana

source: Products
om: Meeshaalee

source: Blog
om: Bilogii

source: Categories
om: Kutaa

source: Customer Service
om: Tajaajila Maamilaa

source: My Account
om: Herrega Koo

source: Order Tracking
om: Duukaa Bu'iinsa Ajajaa

source: Wishlist
om: Wanta Fedhu

source: Returns & Exchanges
om: Deebii fi Jijjiirraa

source: FAQs
om: Gaaffilee Ijjannoo

source: Contact Info
om: Odeeffannoo Quunnamtii

source: Ethiopia / Sheger City , Gelan
om: Itoophiyaa / Magaalaa Sheger, Gelan

source: Sheger.xyz All Rights Reserved.
om: Sheger.xyz Mirgi Hundaa Eegameera.

source: Find Your Dream Home Today
om: Mana abjuu kee har'a argadhu

source: Thousands of properties waiting for you
om: Qabeenyi kumaatamaan si eeggachaa jira

source: House
om: Mana

source: Ethiopian Poultry Farm
om: Qonna Foollee Itoophiyaa

source: Eggs, Chickens, poultry Equipment and tools for sell
om: Qeelloo, hoolota, meeshaalee foollee fi meeshaalee gurgurtaa

source: poultry
om: foollee

source: Latest Car Models
om: Mootoraalee Haaraa

source: New arrivals with amazing deals
om: Meeshaalee haaraa waliigaltee dinqisiisaa waliin dhufan

source: car
om: mootoraa

source: Summer Tech Sale
om: Gurgurtaa Teknolojii Bonaa

source: Up to 40%% off on electronics
om: Elekktirooniksii irratti hanga 40%% hir'ata

source: Shop by Category
om: Kutaa irratti bitadhu

source: 5,000+ listings
om: Tarree 5,000 olii

source: 2,500+ properties
om: Qabeenya 2,500 olii

source: 10,000+ products
om: Meeshaalee 10,000 olii

source: 15,000+ items
om: Meeshaalee 15,000 olii

source: Books
om: Kitaabota

source: 8,000+ titles
om: Mataduree 8,000 olii

source: 3,000+ products
om: Meeshaalee 3,000 olii

source: Featured Products
om: Meeshaalee filataman

source: All
om: Hundaa

source: Toys
om: Taphataa

source: View All Products
om: Meeshaalee Hundaa Ilaali

source: Summer Mega Sale!
om: Gurgurtaa Guddaa Bonaa!

source: Up to 50%% off on selected items. Limited time offer.
om: Meeshaalee filataman irratti hanga 50%% hir'ata. Yeroo murtaa'eef qofa.

source: Shop Now
om: Amma bitadhu

source: Messages Received
om: Ergaa argame

source: No messages yet.
om: Ergaan hin jiru

source: Terms
om: Shira

source: User Agreement
om: Waliigaltee Fayyadamaa

source: By using our website, you agree to the following terms and conditions.
om: Weebsaayitii keenya fayyadamuun shira fi haala armaan gadii ni waliigaltee.
