Repository: tamrattamrat0506-code/tamrat_render_poultry
Catalog: clothings/locale/*/LC_MESSAGES/django.po
Languages: am

source: Add New Clothing Item
am: አዲስ የልብስ ነገር ያክሉ

source: Fill out the form below to list your clothing item
am: የልብስዎን ነገር ለማስተዋወቅ ቅጹን ይሙሉ

source: Basic Information
am: መሠረታዊ መረጃ

source: ETB
am: ብር

source: In Stock
am: በአቅም ውስጥ

source: Item Details
am: የነገሩ ዝርዝሮች

source: View Size Chart
am: የመጠን ሰንጠረዥ ይመልከቱ

source: characters
am: ቁምፊዎች

source: Images
am: ምስሎች

source: Drag & drop images here or click to browse
am: ምስሎችን እዚህ ይጎትቱ ወይም ለመመልከት ይጫኑ

source: First image will be used as the main display image
am: የመጀመሪያው ምስል አስዋቂ ምስል ይሆናል

source: Recommended size: 800x1000 pixels
am: የሚመከር መጠን፡ 800x1000 ፒክስል

source: Features
am: ባህሪያት

source: Save Item
am: ነገሩን ያቅርቡ

source: Preview
am: ቅድመ እይታ

source: Cancel
am: ይቅር

source: Clothing Size Chart
am: የልብስ መጠን ሰንጠረዥ

source: Size
am: መጠን

source: Chest (in)
am: የደረት መጠን (በኢንች)

source: Waist (in)
am: የወገብ መጠን (በኢንች)

source: Hip (in)
am: የወገብ መጠን (በኢንች)

source: XS
am: በጣም ትንሽ

source: S
am: ትንሽ

source: Add to Cart
am: ወደ ጋሪ ያክሉ

source: Details
am: ዝርዝሮች

source: Material:
am: ንጥረ ነገር፡

source: Color:
am: ቀለም፡

source: Size:
am: መጠን፡

source: Age Group:
am: የዕድሜ ቡድን፡

source: You May Also Like
am: ምናልባት ይወዳሉ

source: View Details
am: ዝርዝሮችን ይመልከቱ

source: No clothing items found.
am: ምንም የልብስ ነገሮች አልተገኙም።

source: Try again later or add new items.
am: በኋላ ደግመው ይሞክሩ ወይም አዲስ ነገሮች ያክሉ።
