Repository: tamrattamrat0506-code/tamrat_render_poultry
Catalog: clothings/locale/om/LC_MESSAGES/django.po
Languages: om

source: Add New Clothing Item
om: Ulfaa Haaraa Dabaluu

source: Fill out the form below to list your clothing item
om: Furmaata gadiitti guutii ulfaa kee galmeessi

source: Basic Information
om: Odeeffannoo Ijoo

source: In Stock
om: Gabatee Keessa

source: Item Details
om: Faayila Ulfaa

source: View Size Chart
om: Gabatee Guddinaa Ilaali

source: characters
om: Herregaa

source: Images
om: Suuraalee

source: Drag & drop images here or click to browse
om: Suuraalee asitti harkisi ykn cuqaasi barbaadi

source: First image will be used as the main display image
om: Suuraan jalqabaa suuraa agarsiisaa ijoo ta'a

source: Recommended size: 800x1000 pixels
om: Guddina filatamaa: 800x1000 pikselii

source: Features
om: Amaloota

source: Save Item
om: Ulfaa Olkaa'i

source: Preview
om: Dursi Ilaali

source: Cancel
om: Haquu

source: Clothing Size Chart
om: Gabatee Guddina Ulfaa

source: Size
om: Guddina

source: Chest (in)
om: Kaleessa (in)

source: Waist (in)
om: Hudduu (in)

source: Hip (in)
om: Morma (in)

source: Add to Cart
om: Gabatee Keessa Galchi

source: Details
om: Faayila

source: Material:
om: Qabeenya:

source: Color:
om: Halluu:

source: Size:
om: Guddina:

source: Age Group:
om: Gosa Umurii:

source: You May Also Like
om: Kan Siif Toluu Mala

source: View Details
om: Faayila Ilaali

source: No clothing items found.
om: Ulfaan hin argamne.

source: Try again later or add new items.
om: Booda irra deebi'i yookaan ulfaa haaraa dabaluu.
